Repository: malakhovks/vec2read
Catalog: ui/src/i18n/messages.*.xlf
Languages: ru

source: Колектив розробників
ru: Команда разработчиков

source: Величко Віталій Юрійович
ru: Малахова Татьяна Борисовна

source: Доцент, к.т.н., с.н.с.
ru: Специальность/Должность

source: Інститут кібернетики ім. В.М. Глушкова НАН України. Відділ мікропроцесорної техніки № 205
ru: Луганское общеобразовательное учреждение — средняя общеобразовательная школа №17 имени Валерия Брумеля

source: Малахов Кирило Сергійович
ru: Малахов Кирилл Сергеевич

source: Науковий співробітник
ru: Научный сотрудник

source: Щуров Олександр Сергійович
ru: Щуров Олександр Сергеевич

source: Молодший науковий співробітник
ru: м.н.с.

source: Копіювати URL
ru: Копировать URL

source: Корисні посилання
ru: Полезные ресурсы

source: Туторіал з tensorflow.org на тему "Векторне представлення слів/Навчання вкладень слів"
ru: Тренинг Word2Vec от TensorFlow Core

source: Програмна бібліотека з відкритим початковим кодом для навчання вкладень слів та класифікування тексту
ru: Программная библиотека с открытым исходным кодом для обучения векторного представления слов и классификации текстов

source: Програмна бібліотека з відкритим початковим кодом для комплексного моделювання мовного векторного простору
ru: Программная библиотека с открытым исходным кодом для комплексного моделирования языкового векторного пространства

source: Відкрита для приєднання спільнота фахівців в галузі комп'ютерної обробки текстів
ru: Lang-uk - открытое для присоединения сообщество специалистов в области компьютерной обработки текстов

source: Проблеми програмування
ru: Проблемы программирования

source: Моделі:
ru: Модели:

source: Обчислення семантичної близькості однослівних сутностей
ru: Вычисление семантической близости однословных сущностей

source: Сервіс обчислює семантичні відношення між словами українською мовою в рамках обраної моделі.
ru: Сервис Vec2Read вычисляет семантические отношения между словами в рамках выбранной модели.

source: В дистрибутивній семантиці слова зазвичай представляються у вигляді векторів в багатовимірному просторі їх контекстів. Семантична схожість обчислюється як косинусна близькість між векторами двох слів і може приймати значення в проміжку [-1 ... 1] (на практиці часто використовуються тільки значення вище 0). Значення 0 приблизно означає, що у цих слів немає схожих контекстів і їх значення не пов'язані один з одним. Значення 1, навпаки, свідчить про повну ідентичність їх контекстів і, отже, про близькість значення.
ru: В дистрибутивной семантике слова обычно представляются в виде векторов в многомерном пространстве их контекстов. Семантическое сходство вычисляется как косинусная близость между векторами двух слов и может принимать значения в промежутке [-1...1] (на практике часто используются только значения выше 0). Значение 0 приблизительно означает, что у этих слов нет похожих контекстов и их значения не связаны друг с другом. Значение 1, напротив, свидетельствует о полной идентичности их контекстов и, следовательно, о близком значении.

source: Введіть лему слова для порівняння
ru: Введите лемму слова для сравнения

source: Обчислити
ru: Вычислить

source: Косинусна близькість:
ru: Косинусная близость:

source: Обчислення семантичних асоціатів для однослівних сутностей
ru: Вычисление семантических ассоциатов для однословных сущностей

source: Сервіс обчислює семантичні асоціати слова українською мовою в рамках обраної моделі.
ru: Сервис Vec2Read вычисляет семантические ассоциаты в рамках выбранной модели.

source: Введіть лему слова
ru: Введите лемму слова

source: Семантичні асоціати
ru: Семантические ассоциаты

source: Сутність
ru: Сущность

source: Косинусна близькість
ru: Косинусная близость

source: Обчислення центру лексичного кластера однослівних сутностей
ru: Вычисление центра лексического кластера однословных сущностей

source: Сервіс обчислює центр лексичного кластера слів українською мовою в рамках обраної моделі.
ru: Сервис Vec2Read вычисляет центр лексического кластера однословных сущностей в рамках выбранной модели.

source: Введіть леми слів через пробіл
ru: Введите леммы слов через пробел

source: Центр лексичного кластера
ru: Центр лексического кластера

source: Про проєкт Vec2Read
ru: О проекте Vec2Read

source: Сервіс Vec2Read обчислює семантичні відношення між сутностями української мови в рамках обраної дистрибутино-семантичної моделі векторного представлення сутностей.
ru: Сервис Vec2Read вычисляет семантические отношения между однословными сущностями в рамках выбранной дистрибутивно-семантической модели векторного представления сущностей.

source: Поняття векторного представлення сутностей
ru: Понятие векторного представления сущностей

source: Векторне представлення (англ. Word embedding) – це техніка, яка розглядає сутності (слова, терміни, документи та інше) як вектори, відносна схожість між якими корелює з семантичною подібністю. Така техніка є одним із найуспішніших прикладів застосування навчання без учителя (unsupervised learning). Векторні представлення – техніка для опрацювання природної мови, альтернативна до традиційної, яка дозволяє відображати сутності (слова, словосполучення, терміни або документи зі "словника" на вектори дійсних чисел в малому щодо розміру "словника" просторі, а подібність між векторами корелює з семантичною подібністю між сутностями.
ru: Векторное представление (англ. Word embedding) – это техника, рассматривающая сущности (слова, термины, документы и прочее) как векторы, относительное сходство между которыми коррелирует с семантическим сходством. Такая техника является одним из наиболее успешных примеров применения обучения без учителя (unsupervised learning). Векторные представления – техника для обработки естественного языка, альтернативная традиционной, позволяющая отображать сущности (слова, словосочетания, термины или документы) из словаря на векторы действительных чисел в малом относительно размера словаря пространстве, а сходство между векторами коррелирует с семантическим сходством между сущностями.

source: Застосування векторних представлень
ru: Применение векторных представлений сущностей

source: Сучасні векторні моделі дозволяють обчислити семантичну подібність між словами, реченнями чи документами, і саме на цих можливостях ґрунтується їхнє використання для розв’язання завдань опрацювання природної мови. Векторні представлення використовують безпосередньо, а також як ознаки для розв’язання насамперед завдань класифікації та кластеризації: розпізнавання іменованих сутностей, морфологічний аналіз слів, аналіз тональности текстів, класифікація/кластеризація документів, класифікація/кластеризація пошукових запитів, класифікація веб-сторінок, ранжування документів, кластеризація заголовків веб-сторінок. Також із використанням векторних представлень вирішують завдання ґенерації текстів, машинного перекладання, виявлення парафраз, моделювання текстів.
ru: Современные векторные модели позволяют вычислить семантическое сходство между словами, предложениями или документами, и именно на этих возможностях основывается их использование для решения задач обработки естественного языка. Векторные представления используют непосредственно, а также как признаки решения прежде всего задач классификации и кластеризации: распознавание именуемых сущностей, морфологический анализ слов, анализ тональности текстов, классификация/кластеризация документов, классификация/кластеризация поисковых запросов, классификация веб-страниц, ранжирование документов кластеризация заголовков веб-страниц. Также с использованием векторных представлений решают задачи генерации текстов, машинного перевода, обнаружения парафраз, моделирования текстов.

source: Проєкт на Github
ru: Проект на GitHub

source: Семантична близькість
ru: Семантическая близость

source: Семантичні асоціати
ru: Семантические ассоциаты

source: Центр лексичного кластера
ru: Центр лексического кластера

source: Семантична карта
ru: Семантическая карта

source: Дистрибутивний аналіз
ru: Дистрибутивно-семантический анализ

source: Про проєкт
ru: О проекте

source: Корисні посилання
ru: Полезные ресурсы

source: Колектив розробників
ru: Команда разработчиков
